#include "Stdafx.h"
#include "ItemClass.h"

/* 
// 아이템 인덱스, 아이템명 , 설명 
0, 모험자의 검, 100L, 토벌에 지원한 모험자를 위한 검
1, 아이언소드, 400L, 강도를 높인 철검
2, 은검, 4000L, 성직자가 쓰는 은제 검
3, 쇠도끼, 380L, 날 부분을 철로 강화한 도끼
4, 실버 액스, 5000L, 마력을 숨긴 은도끼
5, 랜스, 1500L, "찌르는 데 특화, 본래 마상용
6, 플레임 스피어, 4800L, 불꽃의 힘으로 적을 태우는 강력한 창
7, 로드, 400L, 일반 마법사가 쓰는 지팡이
8, 신관의 지팡이, 2500L, 신을 모시는자가 쓰는 신성한 지팡이
9, 모험자의 옷, 100L, 일반 모험자가 입는 옷
10, 로브, 380L, 마법의 힘을 증폭시킨다
11, 강철 갑옷, 800L, 광산에서 캔 돌로 만든 갑옷
12, 라이트닝 아머, 3000L, 가벼운 재질로 만든 갑옷.속도가 상승
13, 대지의 갑옷, 6000L, 어스타이트라는 돌로 만든 갑옷
14, 링 오브 프로미스, 5000L, 모험자의 생환을 비는 반지
15, 바이탈, 100L, HP를 100 회복시키는 약
16, 바이탈모어, 300L, HP를 300 회복시키는 약
17, 메디슨, 80L, SP를 80 회복시키는 약
18, 원더메디슨, 400L, SP를 300 회복시키는 약
19, 리저렉션, 5000L, 가지고 있으면 전투불능 시 자동으로 부활
20, 안티도트, 150L, 독을 치료.맹독을 가진 전갈 꼬리가 재료
21, 안티패럴라이즈, 200L, 마비 치료.치유능력을 가진 약초의 엑기스
22, 안티커즈, 200L, 저주를 푸는 약
23, 안티위크, 200L, 약체화를 치유하는 약
24, 안티오블리비에스, 200L, 망각을 치유하는 약
25, 성녀의 상, 200L, 미궁을 탈출해 마을로 돌아옵니다
*/